package com.evgeny.unit.decompositionMethods;

//Написать метод(методы), определяющий, в каком из данных двух чисел больше цифр.

import java.util.Scanner;

public class TaskElevenDecomposition {
    public static void main(String[] args) {
        int oneNumber, twoNumber;
        Scanner in = new Scanner(System.in);
        System.out.print("Введите первое число: ");
        oneNumber = in.nextInt();
        System.out.print("Введите второе число: ");
        twoNumber = in.nextInt();
    }
    public static void numberMoreDigit(int oneNumber, int twoNumber){

    }
}
