package com.evgeny.unit.arraySorted;

//Сортировка обменами. Дана последовательность чисел a1<=a2<=...<=an .Требуется переставить числа в
//порядке возрастания. Для этого сравниваются два соседних числа ai и a(i+1) . Если ai>a(i+1), то делается
//перестановка. Так продолжается до тех пор, пока все элементы не станут расположены в порядке возрастания.
//Составить алгоритм сортировки, подсчитывая при этом количества перестановок.
public class TaskFourSort {
    public static void main(String[] args) {

    }
}
